{
  "project": "Tap",
  "branchName": "ralph/tap-mvp",
  "description": "TailwindCSS Migration & Theme Redesign - Replace all custom CSS with Tailwind, redesign 5 stunning themes (Paper, Noir, Aurora, Phosphor, Poster), add TUI theme switcher and offline font support",
  "userStories": [
    {
      "id": "US-101",
      "title": "Install and configure TailwindCSS in frontend build",
      "description": "As a developer, I need TailwindCSS integrated into the Vite/Svelte build process so I can use utility classes throughout the application.",
      "acceptanceCriteria": [
        "Install tailwindcss, postcss, autoprefixer as dev dependencies",
        "Create tailwind.config.js with content paths for all Svelte/TS files",
        "Create postcss.config.js with Tailwind and Autoprefixer plugins",
        "Add Tailwind directives (@tailwind base/components/utilities) to main CSS entry",
        "Verify utility classes work in a test component (e.g., class=\"text-red-500\")",
        "Build completes successfully with no CSS errors",
        "Typecheck passes"
      ],
      "priority": 1,
      "passes": true,
      "notes": "Tailwind v4 uses @import 'tailwindcss' and @tailwindcss/postcss plugin"
    },
    {
      "id": "US-102",
      "title": "Configure Tailwind for presentation-specific design tokens",
      "description": "As a developer, I need Tailwind configured with presentation-appropriate scales so themes can use consistent, large typography and spacing.",
      "acceptanceCriteria": [
        "Extend fontSize with presentation scale: slide-title (8rem), slide-h1 (6rem), slide-h2 (4rem), slide-h3 (2.5rem), slide-body (2rem), slide-code (1.5rem), slide-stat (12rem)",
        "Extend fontFamily with sans, mono, and display stacks",
        "Extend spacing for slide-appropriate values (slide padding 80px, content gaps)",
        "Add aspectRatio utilities for 16/9, 4/3, 16/10",
        "Configure animation/transition timing tokens",
        "Add CSS custom property bridge for theme switching (theme-bg, theme-text, theme-accent, etc.)",
        "Typecheck passes"
      ],
      "priority": 2,
      "passes": true,
      "notes": ""
    },
    {
      "id": "US-103",
      "title": "Create theme configuration system with CSS custom properties",
      "description": "As a developer, I need a theming system where themes define CSS custom properties that Tailwind utilities reference, enabling runtime theme switching.",
      "acceptanceCriteria": [
        "Create src/lib/themes/theme-tokens.css defining CSS variable structure",
        "Define required variables: --color-bg, --color-text, --color-muted, --color-accent, --color-code-bg, --font-sans, --font-mono",
        "Configure Tailwind to use these variables (e.g., bg-theme-bg, text-theme-accent)",
        "Theme class on root element (.theme-paper) sets the variable values",
        "Switching theme class instantly updates all colors",
        "Typecheck passes",
        "Verify in browser: switching theme class changes colors immediately"
      ],
      "priority": 3,
      "passes": true,
      "notes": "theme-tokens.css defines CSS variable structure and .theme-paper class; Tailwind already configured with theme.colors.theme bridge in US-102"
    },
    {
      "id": "US-104",
      "title": "Archive legacy CSS and remove imports",
      "description": "As a developer, I need to remove the old CSS architecture so we have a clean slate for the Tailwind migration.",
      "acceptanceCriteria": [
        "Create frontend/src/lib/themes/_legacy/ directory",
        "Move existing theme CSS files (minimal.css, gradient.css, terminal.css, brutalist.css, keynote.css) to _legacy/",
        "Remove imports of legacy CSS files from components",
        "Remove any component-level <style> blocks with custom CSS (keep animation-related styles)",
        "Application still builds (may look broken visually)",
        "Typecheck passes"
      ],
      "priority": 4,
      "passes": true,
      "notes": "Legacy CSS moved to _legacy/, custom styles removed from components while preserving animation-related styles"
    },
    {
      "id": "US-105",
      "title": "Migrate SlideContainer component to Tailwind",
      "description": "As a developer, I need the core slide container using Tailwind so it properly scales and centers slides.",
      "acceptanceCriteria": [
        "Replace all custom CSS in SlideContainer.svelte with Tailwind utilities",
        "Maintain aspect ratio scaling (16:9, 4:3, 16:10) using Tailwind aspect-ratio utilities",
        "Center slide in viewport with flex utilities (flex items-center justify-center)",
        "Support fullscreen mode with appropriate Tailwind classes",
        "Handle window resize correctly",
        "Typecheck passes",
        "Verify in browser: slide scales correctly at different window sizes"
      ],
      "priority": 5,
      "passes": true,
      "notes": "SlideContainer migrated to Tailwind with flex centering, theme CSS variables, fullscreen support, and reduced motion preference"
    },
    {
      "id": "US-106",
      "title": "Migrate SlideRenderer component to Tailwind",
      "description": "As a developer, I need the slide renderer using Tailwind for content display and fragment visibility.",
      "acceptanceCriteria": [
        "Replace all custom CSS in SlideRenderer.svelte with Tailwind utilities",
        "Layout-specific classes applied via Tailwind",
        "Fragment visibility controlled via Tailwind opacity/transform utilities",
        "Background image support maintained with Tailwind bg-cover, bg-center",
        "Typecheck passes",
        "Verify in browser: slides render with correct layout structure"
      ],
      "priority": 6,
      "passes": true,
      "notes": "SlideRenderer migrated to Tailwind with w-full h-full p-slide, layout classes passed through, background via inline styles, fragment transitions use 300ms timing"
    },
    {
      "id": "US-107A",
      "title": "Migrate Title, Section, and Default layout components to Tailwind",
      "description": "As a developer, I need the core layout components (Title, Section, Default) using Tailwind.",
      "acceptanceCriteria": [
        "LayoutTitle.svelte - centered title with subtitle using Tailwind flex/text utilities",
        "LayoutSection.svelte - large section header centered using Tailwind",
        "LayoutDefault.svelte - standard content layout with proper padding/spacing",
        "All layouts use theme CSS variables via Tailwind utilities (text-theme-text, bg-theme-bg)",
        "Typecheck passes",
        "Verify in browser: title, section, and default layouts render correctly"
      ],
      "priority": 7,
      "passes": true,
      "notes": "Created src/lib/styles/layouts.css with layout typography styles. All three components use theme CSS variables (--color-text, --color-muted, --color-accent, --color-code-bg, --font-mono)"
    },
    {
      "id": "US-107B",
      "title": "Migrate TwoColumn, ThreeColumn, and Sidebar layout components to Tailwind",
      "description": "As a developer, I need the column-based layout components using Tailwind grid.",
      "acceptanceCriteria": [
        "LayoutTwoColumn.svelte - CSS grid via Tailwind (grid grid-cols-2 gap-8)",
        "LayoutThreeColumn.svelte - three-column grid using Tailwind",
        "LayoutSidebar.svelte - main content with sidebar using Tailwind grid",
        "All layouts use theme CSS variables via Tailwind utilities",
        "Typecheck passes",
        "Verify in browser: column layouts render with correct grid structure"
      ],
      "priority": 8,
      "passes": true,
      "notes": "Added CSS grid layouts to layouts.css. TwoColumn uses 1fr 1fr, ThreeColumn uses 1fr 1fr 1fr, Sidebar uses 2fr 1fr with border separator. All use theme CSS variables (--color-text, --color-muted, --color-accent, --color-code-bg, --font-mono)"
    },
    {
      "id": "US-107C",
      "title": "Migrate CodeFocus, Quote, and BigStat layout components to Tailwind",
      "description": "As a developer, I need the specialized content layout components using Tailwind.",
      "acceptanceCriteria": [
        "LayoutCodeFocus.svelte - full-width code using Tailwind (w-full, proper padding)",
        "LayoutQuote.svelte - styled blockquote with accent border using Tailwind",
        "LayoutBigStat.svelte - large number emphasis with massive text using Tailwind",
        "All layouts use theme CSS variables via Tailwind utilities",
        "Typecheck passes",
        "Verify in browser: code-focus, quote, and big-stat layouts render correctly"
      ],
      "priority": 9,
      "passes": true,
      "notes": "Added CSS rules for layout-code-focus, layout-quote, and layout-big-stat to layouts.css. CodeFocus has flex-grow code blocks, Quote uses 6px accent border with centered layout, BigStat uses 12rem font for massive stat display. All use theme CSS variables (--color-text, --color-muted, --color-accent, --color-code-bg, --font-mono)"
    },
    {
      "id": "US-107D",
      "title": "Migrate Cover, SplitMedia, and Blank layout components to Tailwind",
      "description": "As a developer, I need the remaining layout components using Tailwind.",
      "acceptanceCriteria": [
        "LayoutCover.svelte - full-bleed background using Tailwind (bg-cover, bg-center, absolute inset-0)",
        "LayoutSplitMedia.svelte - image + text side-by-side using Tailwind grid",
        "LayoutBlank.svelte - empty canvas with minimal styling",
        "All layouts use theme CSS variables via Tailwind utilities",
        "Typecheck passes",
        "Verify in browser: cover, split-media, and blank layouts render correctly"
      ],
      "priority": 10,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-108",
      "title": "Migrate typography and prose styling to Tailwind",
      "description": "As a developer, I need base typography (headings, paragraphs, lists, code, tables) styled via Tailwind.",
      "acceptanceCriteria": [
        "Create src/lib/styles/prose.css with Tailwind @apply for markdown content",
        "Style h1-h6 with appropriate sizes from presentation scale (slide-h1, slide-h2, etc.)",
        "Style paragraphs and list items with proper spacing",
        "Style inline code with background and padding",
        "Style code blocks (pre) with theme-aware backgrounds",
        "Style blockquotes with accent border",
        "Style tables with proper borders and padding",
        "Style links with accent color and hover states",
        "Typecheck passes",
        "Verify in browser: markdown content renders beautifully"
      ],
      "priority": 11,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-109",
      "title": "Migrate UI components to Tailwind",
      "description": "As a developer, I need all UI components (ProgressBar, ConnectionIndicator, LiveCodeBlock, etc.) using Tailwind.",
      "acceptanceCriteria": [
        "ProgressBar.svelte - thin accent-colored bar using Tailwind (h-1 bg-theme-accent)",
        "ConnectionIndicator.svelte - subtle corner indicator using Tailwind",
        "LiveCodeBlock.svelte - code display with run button using Tailwind",
        "FragmentContainer.svelte - fragment wrapper using Tailwind opacity/transform",
        "SlideOverview.svelte - thumbnail grid using Tailwind grid utilities",
        "AsciinemaPlayer.svelte - player wrapper using Tailwind",
        "All components use theme CSS variables",
        "Typecheck passes",
        "Verify in browser: all UI components render correctly"
      ],
      "priority": 12,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-110",
      "title": "Migrate presenter view to Tailwind",
      "description": "As a developer, I need the presenter view page using Tailwind for its multi-panel layout.",
      "acceptanceCriteria": [
        "Main layout with current slide, next preview, notes panel using Tailwind grid",
        "Timer display styled with Tailwind (text-4xl font-mono)",
        "Slide counter styled with Tailwind",
        "Touch-friendly controls sized appropriately (min-h-12, p-4)",
        "Responsive for tablet use",
        "Typecheck passes",
        "Verify in browser: presenter view is functional and well-styled"
      ],
      "priority": 13,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-111",
      "title": "Design and implement Paper theme",
      "description": "As a user, I want the Paper theme to feel ultra-clean and airy—like a fresh sheet of premium paper where content takes center stage.",
      "acceptanceCriteria": [
        "Create src/lib/themes/paper.css with CSS custom properties only",
        "Color palette: Pure white background (#ffffff), near-black text (#0a0a0a), sophisticated gray for muted (#71717a), subtle warm accent (#78716c)",
        "Typography: Inter / system-ui for headings and body with confident letter-spacing (-0.02em), perfect line heights",
        "Subtle refinements: Delicate shadows on code blocks, refined border radii (8px), generous whitespace",
        "Code blocks: Dark (#1e1e1e) with excellent contrast",
        "Transitions: Smooth, confident fades (400ms ease-out)",
        "Typecheck passes",
        "Verify in browser: theme looks premium and effortlessly clean"
      ],
      "priority": 14,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-112",
      "title": "Design and implement Aurora theme",
      "description": "As a user, I want the Aurora theme to feel like the northern lights—vibrant color flows, glassmorphism, dynamic and mesmerizing.",
      "acceptanceCriteria": [
        "Create src/lib/themes/aurora.css with CSS custom properties only",
        "Color palette: Rich gradient backgrounds (deep purples #4c1d95 to electric blues #0ea5e9 to teals #14b8a6), white text",
        "Background: Animated gradient mesh using CSS @keyframes with subtle movement",
        "Glassmorphism: Frosted glass cards with backdrop-blur-xl and semi-transparent backgrounds",
        "Typography: Space Grotesk for headings and body",
        "Code blocks: Semi-transparent dark glass (rgba(0,0,0,0.6)) with backdrop-blur",
        "Accent elements: Glowing borders (box-shadow with spread), subtle light leaks",
        "Typecheck passes",
        "Verify in browser: theme is vibrant, dynamic, and modern"
      ],
      "priority": 15,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-113",
      "title": "Design and implement Phosphor theme",
      "description": "As a user, I want the Phosphor theme to feel like authentic CRT monitors—glowing phosphor text, scanlines, retro-futuristic hacker aesthetic.",
      "acceptanceCriteria": [
        "Create src/lib/themes/phosphor.css with CSS custom properties only",
        "Color palette: True black (#000) background, phosphor green (#00ff00) as primary, dim gray (#333) for muted",
        "CRT effects: Subtle scanlines overlay using repeating-linear-gradient, slight screen curve vignette",
        "Typography: JetBrains Mono throughout for authentic terminal feel",
        "Text effects: Multi-layer text-shadow for phosphor glow (0 0 5px, 0 0 10px, 0 0 20px)",
        "Code blocks: No background change—everything IS terminal",
        "Typecheck passes",
        "Verify in browser: theme has authentic retro-tech CRT feel with glowing text"
      ],
      "priority": 16,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-114",
      "title": "Design and implement Poster theme",
      "description": "As a user, I want the Poster theme to feel like bold graphic design—giant typography, high contrast, impossible to ignore.",
      "acceptanceCriteria": [
        "Create src/lib/themes/poster.css with CSS custom properties only",
        "Color palette: Stark black (#000) and white (#fff), with ONE bold accent (electric red #ef4444)",
        "Typography: Anton for headings (ALL CAPS via text-transform), massive scale, system sans for body",
        "Layout elements: Thick black borders (4px+), harsh drop shadows (8px 8px 0 black), geometric blocks",
        "No rounded corners: Everything sharp and rectangular (border-radius: 0)",
        "Code blocks: Inverted colors (white on black), monospace with visible structure",
        "Typecheck passes",
        "Verify in browser: theme is bold, graphic, and striking"
      ],
      "priority": 17,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-115",
      "title": "Design and implement Noir theme",
      "description": "As a user, I want the Noir theme to feel cinematic and sophisticated—deep blacks, dramatic lighting, film noir elegance.",
      "acceptanceCriteria": [
        "Create src/lib/themes/noir.css with CSS custom properties only",
        "Color palette: Deep charcoal backgrounds (#0a0a0a), crisp white text (#fafafa), sophisticated gold accent (#d4af37)",
        "Typography: Playfair Display for titles (serif), Inter for body (sans-serif)",
        "Cinematic depth: Multi-layer soft shadows, subtle vignette effect on slides",
        "Subtle gradients: Very subtle dark-to-darker gradients (linear-gradient) for richness",
        "Code blocks: Elevated card style with refined shadows and slight border",
        "Typecheck passes",
        "Verify in browser: theme looks sophisticated, dark, and executive"
      ],
      "priority": 18,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-116",
      "title": "Implement simple color customization for built-in themes",
      "description": "As a user, I want to easily swap colors in built-in themes via frontmatter so I can match my brand.",
      "acceptanceCriteria": [
        "Support themeColors object in frontmatter: { accent: '#ff0000', background: '#000' }",
        "Parse themeColors in Go config parser (internal/config/config.go)",
        "Pass themeColors to frontend via presentation JSON",
        "Apply color overrides as inline CSS variables on root element in frontend",
        "Supported color keys: background, text, muted, accent, codeBg",
        "Partial overrides work (only specify what you want to change)",
        "Invalid colors ignored gracefully with console warning",
        "Typecheck passes",
        "Verify in browser: custom colors applied correctly override theme defaults"
      ],
      "priority": 19,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-117",
      "title": "Implement custom theme support via user CSS file",
      "description": "As a power user, I want to define a completely custom theme by providing my own CSS file.",
      "acceptanceCriteria": [
        "Support customTheme: './my-theme.css' in frontmatter (path relative to markdown file)",
        "Parse customTheme path in Go config parser",
        "Load and inject custom CSS file at runtime in dev mode via <link> tag",
        "Embed custom CSS at build time for static builds",
        "Custom theme CSS can define all CSS variables to completely override defaults",
        "Error handling: graceful fallback if custom theme file not found (log warning, use default theme)",
        "Typecheck passes",
        "Verify in browser: custom theme fully applied"
      ],
      "priority": 20,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-118",
      "title": "Create animation utilities with Tailwind + Svelte transitions",
      "description": "As a developer, I need a clean approach for animations that combines Tailwind utilities with Svelte transitions.",
      "acceptanceCriteria": [
        "Create src/lib/styles/animations.css for complex animations only",
        "Include CRT scanline animation for Phosphor theme",
        "Include gradient mesh animation for Aurora theme",
        "Include phosphor glow keyframes",
        "Keep file minimal—only what Tailwind truly cannot do",
        "Document which animations are Tailwind vs custom in code comments",
        "Svelte transitions used for slide transitions (fade, fly, scale)",
        "Fragment reveals use Tailwind opacity/transform with transition-all",
        "Typecheck passes",
        "Verify in browser: all animations work smoothly"
      ],
      "priority": 21,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-119",
      "title": "Update embedded asset build to include Tailwind output",
      "description": "As a developer, I need the Go binary to embed the Tailwind-built CSS correctly.",
      "acceptanceCriteria": [
        "Vite build outputs optimized CSS with Tailwind utilities to dist/",
        "CSS is properly purged (only used utilities included) via Tailwind content config",
        "Output CSS copied to ../embedded/ directory via build:embed script",
        "Go embed directive in embedded/embed.go picks up the new CSS",
        "Binary serves correct styles when running tap dev",
        "Build size is reasonable (target: <50KB CSS gzipped)",
        "Typecheck passes"
      ],
      "priority": 22,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-120",
      "title": "Update documentation for new theming system",
      "description": "As a user, I need documentation explaining how to use themes, customize colors, and create custom themes.",
      "acceptanceCriteria": [
        "Update SPEC.md with new theming architecture (Tailwind + CSS custom properties)",
        "Document all 5 themes with visual descriptions: Paper, Noir, Aurora, Phosphor, Poster",
        "Document themeColors frontmatter option with examples",
        "Document customTheme CSS file approach with template showing required CSS variables",
        "Update testdata/sample.md to use theme: paper",
        "Typecheck passes"
      ],
      "priority": 23,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-121",
      "title": "Rename theme references in Go backend",
      "description": "As a developer, I need all Go code updated to use the new theme names (paper, noir, aurora, phosphor, poster).",
      "acceptanceCriteria": [
        "Update internal/config/config.go theme validation to accept: paper, noir, aurora, phosphor, poster",
        "Update default theme from 'minimal' to 'paper'",
        "Update theme list in CLI help text (tap new --help)",
        "Update TUI theme selector options in internal/tui/new.go with new names and descriptions",
        "Add backwards compatibility: old names (minimal, gradient, terminal, brutalist, keynote) map to new names with deprecation warning logged",
        "All Go tests pass with new theme names",
        "Typecheck passes"
      ],
      "priority": 24,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-122",
      "title": "Rename theme files and references in frontend",
      "description": "As a developer, I need all frontend code updated to use the new theme names.",
      "acceptanceCriteria": [
        "Theme CSS files already created with new names in US-111 through US-115",
        "Update all CSS class references in components (.theme-minimal to .theme-paper, etc.)",
        "Update theme imports in main app entry point",
        "Update TypeScript types/enums for theme names in src/lib/types.ts",
        "Update any hardcoded theme references in Svelte components",
        "Typecheck passes",
        "Verify in browser: all themes load correctly with new names"
      ],
      "priority": 25,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-123",
      "title": "Update sample presentations and test data",
      "description": "As a developer, I need all sample presentations updated to use the new theme names.",
      "acceptanceCriteria": [
        "Update testdata/sample.md frontmatter to use theme: paper",
        "Update any other test fixtures in testdata/ referencing old theme names",
        "Create or update examples/ directory with presentations for each theme",
        "Grep entire codebase for old theme names (minimal, gradient, terminal, brutalist, keynote) and update any remaining references",
        "Typecheck passes"
      ],
      "priority": 26,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-124",
      "title": "Update SPEC.md with new theme names and descriptions",
      "description": "As a developer, I need the product specification updated to reflect the new theme names.",
      "acceptanceCriteria": [
        "Replace all references to 'minimal' with 'paper' in SPEC.md",
        "Replace all references to 'keynote' with 'noir' in SPEC.md",
        "Replace all references to 'gradient' with 'aurora' in SPEC.md",
        "Replace all references to 'terminal' with 'phosphor' in SPEC.md",
        "Replace all references to 'brutalist' with 'poster' in SPEC.md",
        "Update theme descriptions to match new visual directions",
        "Update any code examples showing theme configuration",
        "Typecheck passes"
      ],
      "priority": 27,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-125",
      "title": "Add theme switcher to dev server TUI",
      "description": "As a presenter, I want to quickly switch themes from the dev server TUI to preview my presentation in different themes.",
      "acceptanceCriteria": [
        "Add 't' keyboard shortcut to open theme switcher in tap dev TUI (internal/tui/dev.go)",
        "Create theme picker component showing all 5 themes: Paper, Noir, Aurora, Phosphor, Poster",
        "Show theme name and brief one-line description for each option",
        "Arrow keys to navigate, Enter to select, Escape to cancel",
        "Selecting a theme broadcasts theme change via WebSocket to all connected browsers",
        "Current theme highlighted in the picker",
        "Theme change is temporary (doesn't modify markdown file)",
        "Display current theme name in TUI status bar",
        "Typecheck passes"
      ],
      "priority": 28,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-125B",
      "title": "Implement WebSocket theme switching in frontend",
      "description": "As a presenter, I want the browser to instantly switch themes when I select one in the TUI.",
      "acceptanceCriteria": [
        "Add 'theme' message type to WebSocket handler in frontend",
        "When 'theme' message received, update root element class to new theme",
        "Theme switch happens instantly without page reload",
        "Update presentation store to track current theme override",
        "Typecheck passes",
        "Verify in browser: theme switches instantly when selected in TUI"
      ],
      "priority": 29,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-126",
      "title": "Install and configure embedded fonts",
      "description": "As a presenter, I need all fonts embedded so presentations work fully offline.",
      "acceptanceCriteria": [
        "Install font packages via npm: @fontsource/inter, @fontsource/space-grotesk, @fontsource/jetbrains-mono, @fontsource/playfair-display, @fontsource/anton",
        "Create src/lib/styles/fonts.css that imports required font weights",
        "Import Inter weights: 400, 500, 600, 700",
        "Import Playfair Display weights: 400, 700",
        "Import Space Grotesk weights: 400, 500, 700",
        "Import JetBrains Mono weights: 400, 700",
        "Import Anton weight: 400",
        "Import fonts.css in main app entry point",
        "Typecheck passes"
      ],
      "priority": 30,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-126B",
      "title": "Wire up embedded fonts to themes and verify offline support",
      "description": "As a presenter, I need fonts to load correctly in each theme and work offline.",
      "acceptanceCriteria": [
        "Update Paper theme to use font-family: Inter, system-ui, sans-serif",
        "Update Noir theme to use Playfair Display for headings, Inter for body",
        "Update Aurora theme to use Space Grotesk",
        "Update Phosphor theme to use JetBrains Mono throughout",
        "Update Poster theme to use Anton for headings, system sans for body",
        "Fonts included in Vite build output (check dist/ after build)",
        "Verify presentations render correctly with network disabled in browser DevTools",
        "Typecheck passes",
        "Verify in browser: fonts load correctly offline for all themes"
      ],
      "priority": 31,
      "passes": false,
      "notes": ""
    }
  ]
}
